// chess
// Сформируйте строку с шахматной доской из вложенных циклов. Для перевода строки используйте \n. Код должен поддерживать легкое изменение размеров доски.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.

var symbol1 = '#';
var symbol2 = '.';
var string = '';
debugger;
for (var j = 0; j < 10; j++) {
    for (var i = 0; i < 11; i++) {
        if (string.length % 2 == 0 && string.length < 11) {
            string += symbol2;
        }
        if (string.length % 2 !== 0 && string.length < 11) {
            string += symbol1;
        }
    }
    string += '\n';
}
console.log(string);
