// chess
// Сформируйте строку с шахматной доской из вложенных циклов. Для перевода строки используйте \n. Код должен поддерживать легкое изменение размеров доски.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.

var symbol1 = '#';
var symbol2 = '.';
var string = '';
for (var j = 0; j < 10; j++) {
    for (var i = 1; i < 12; i++) {
        string += i % 2 === j % 2 ? symbol1 : symbol2
    }
    string += '\n';
}
console.log(string);

